<%@ Page Title="关于" Language="C#" MasterPageFile="~/Site.Master" AutoEventWireup="true" CodeBehind="About.aspx.cs" Inherits="DBVisual.About" %>

<asp:Content ID="BodyContent" ContentPlaceHolderID="MainContent" runat="server">
    <h2><%: Title %></h2>
    <p>《商务网站设计与开发（HTML5、ASP.NET版）》是高等学校“十三五”规划教材，由西安电子科技大学出版社出版发行。本教材提供配套的PPT课件、全部源代码、视频讲解。</p>
    <p>随着互联网、云计算、物联网等热门技术也不断成熟，越来越多的软件开发者希望对网站开发技术进行深入系统地学习，进而成为技术市场上炙手可热的人才。但对于有兴趣学习Web技术的开发者而言，不断涌现（有很多也是昙花一现）的开发工具、程序设计语言和设计框架让人眼花缭乱、无可是从，很多网站开发的初学者徘徊在JSP、PHP、ASP.NET等技术之间，不知该从何学起。</p>
    <p>本教程的作者从事网站开发和相关教学工作十多年，目睹了大量Web技术向走马灯一样快速流行、瞬间过时。在指导本科生和研究生的过程中，作者一直在思考究竟什么样的学习路径可以让开发者快速、系统地掌握Web开发技术。通过大量实践，作者比较了JSP、PHP、ASP.NET等多种开发技术，逐渐总结了一些规律。</p>
    <p>PHP技术：这是网站开发者最热衷的技术之一，它的特点就是“快”，学起来快，开发过程也快。如此说来PHP技术应该是网站开发的不二法门，但快是有代价的，比如语言过于灵活，对代码的约束较少，程序员容易在不知不觉中写出错误代码。当然，在小团队进行小型网站的开发过程中，这些缺点可能并不会带来严重的问题。但对于初学者而言，一个太容易上手的技术，往往会让开发者忽略了系统底层的运行机理。应该说，这本身并不是PHP的错，而是由于初学者在使用PHP开发小型网站时不必充分理解Web系统的运行机理。所以，“易学易用”本身就是一把双刃剑。</p>
    <p>&nbsp;JSP技术：需要开发者首先掌握Java程序设计技术，然后从最简单的“Hello World”程序开始学起。由于基本的JSP网站开发需要程序员书写大量代码，所以开发效率较低，学习过程较长。但这一缺点带来的好处是：开发者可以逐渐理解网站的运行机理，包括Web服务器的工作方式和浏览器对HTML的解析方式，进而构建出完整的网站开发知识结构。当然，在很好地掌握基本的JSP开发技术之后，可以进一步学习使用多种基于Java的开发框架，从而有效地提高开发效率。 </p>
    <p>ASP.NET技术：沿袭微软公司开发工具的一贯风格，基于ASP.NET的网站开发提供了“拖拖拽拽”的可视化开发工具，这种开发模式不仅让初学者可以很快掌握Web开发的大多数技术，而且也会大大提高资深程序员的工作效率。不得不承认：开发的速度是软件公司生存的重要基础之一。但与PHP的情况类似，易于“掌握”的开发技术，往往会让初学者忽略了本该了解的可视化背后的故事。我们看到许多自认为已经充分掌握ASP.NET网站设计技术的开发者在被问到“session的运行机理是什么”或者“cookie是如何保存客户数据的”这类问题时，居然连问题都听不懂，这多么尴尬啊。再次说明：这不是ASP.NET的错，而是学习的“快车道”让初学者太快体会到成功的喜悦，以至于根本无暇欣赏沿途的风景。</p>
    <p>总结上述分析，作者建议初学者从JSP学起，在充分掌握Web运行机理和开发思路的基础上，可以再学习ASP.NET、PHP或基于Java的开发框架。扎实的基础将让开发者走得更远，且越走越快。但是，如果初学者选择直接学习ASP.NET技术，则应当特别重视其中的Web运行机理部分，在对非可视化代码编写有了较好的掌握后，再学习基于可视化的设计和开发，这也是本教程的章节安排思路。这样，既能把将相关知识理解扎实，又可以通过可视化的开发方式提高开发效率。</p>
    <p>任何教材都无法与网站开发技术的飞速发展相同步，本教程也不能例外。为了给读者提供进一步学习的思路，教材提供了多个完整的开发实例，并对开发大型而复杂的网站时需要的设计框架进行了介绍。</p>
    <p>温浩宇老师编写了本教程的主要内容，许多研究生参与了本教程的编写：朱艳洁参与编写了第二章和相关的实例；程栋参与编写了第四章的实例；刘芬芳、孙策、李京京、陈玉兆、梁承希、杨璐、姚香秀、刘巧莉、王珺泽、张颖、王若雨等都参与了程序实例的编写、修改和测试。值得一提的是，许多参与本教程编写的优秀研究生毕业后即在著名的IT公司工作，他们的成功经历也激励着许多同学开始认真、系统地学习Web网站开发技术。</p>
    <p>衷心感谢在本教程编写过程中提供帮助的同事和学生！衷心感谢西安电子科技大学出版社的编辑老师对本教材的大力支持！</p>
    <p>Web网站开发技术日新月异，同时作者水平有限，书中难免存在错误和不足之处，敬请批评指正。 </p>
</asp:Content>
